Repository: syhpoon/xyzcmd
Catalog: locale/*/LC_MESSAGES/xyzcmd.po
Languages: uk

source: Switch to tab 0
uk: Переключитись на вкладку 0

source: Switch to tab 1
uk: Переключитись на вкладку 1

source: Switch to tab 2
uk: Переключитись на вкладку 2

source: Switch to tab 3
uk: Переключитись на вкладку 3

source: Switch to tab 4
uk: Переключитись на вкладку 4

source: Switch to tab 5
uk: Переключитись на вкладку 5

source: Switch to tab 6
uk: Переключитись на вкладку 6

source: Switch to tab 7
uk: Переключитись на вкладку 7

source: Switch to tab 8
uk: Переключитись на вкладку 8

source: Switch to tab 9
uk: Переключитись на вкладку 9

source: New tab in inactive panel
uk: Створити нову вкладку в неактивній панелі

source: Remove tab in inactive panel
uk: Видалити вкладку в неактивній панелі

source: Switch to next tab in inactive panel
uk: Переключитись на наступну вкладку в неактивній панелі

source: Switch to previous tab in inactive panel
uk: Переключитись на попередню вкладку в неактивній панелі

source: Switch to tab 0 in inactive panel
uk: Переключитись на вкладку 0 в неактивній панелі

source: Switch to tab 1 in inactive panel
uk: Переключитись на вкладку 1 в неактивній панелі

source: Switch to tab 2 in inactive panel
uk: Переключитись на вкладку 2 в неактивній панелі

source: Switch to tab 3 in inactive panel
uk: Переключитись на вкладку 3 в неактивній панелі

source: Switch to tab 4 in inactive panel
uk: Переключитись на вкладку 4 в неактивній панелі

source: Switch to tab 5 in inactive panel
uk: Переключитись на вкладку 5 в неактивній панелі

source: Switch to tab 6 in inactive panel
uk: Переключитись на вкладку 6 в неактивній панелі

source: Switch to tab 7 in inactive panel
uk: Переключитись на вкладку 7 в неактивній панелі

source: Switch to tab 8 in inactive panel
uk: Переключитись на вкладку 8 в неактивній панелі

source: Switch to tab 9 in inactive panel
uk: Переключитись на вкладку 9 в неактивній панелі

source: Complete the command line
uk: Доповнити вміст командного рядка

source: Add bookmark
uk: Додати закладку

source: Run default pager
uk: Запустити стандартний пейджер

source: Run default editor
uk: Запустити стандартний редактор

source: Chdir in active panel to the same dir as in inactive one
uk: В активній панелі перейти в той самий каталог, що в неактивній

source: Unable to register action: invalid rule: %s
uk: Неможливо зареєструвати дію: неправильне правило: %s

source: Class must be instantiated first!
uk: Клас має бути спочатку ініційованим!

source: DSL Error: %s
uk: Помилка DSL: %s

source: Unable to load plugin %s: %s
uk: Неможливо загрузить плагін %s: %s

source: Unable to bind shortcut %s: %s
uk: Неможливо зв'язати клавіатурну комбінацію %s: %s

source: Unable to execute file: %s
uk: Неможливо виконати файл: %s

source: Unable to register action: %s
uk: Неможливо зареєструвати дію: %s

source: Unable to expand macro %s: %s
uk: Неможливо розгорнути макрос %s: %s

source: Unable to execute method %s: %s
uk: Неможливо виконати метод: %s

source: Error in DSL shell execution: %s
uk: Помилка під час виконання DSL оболонки: %s

source: Invalid object type: %s. Function expected
uk: Неправильний тип об'єкту: %s. Очікується функція

source: Invalid opts type: %s. Dict instance expected
uk: Неправильний тип аргументу: %s. Очікується словник (dict)

source: Invalid function %s
uk: Неправильна функція

source: Error setting VFS prefix: %s
uk: Помилка установки VFS префіксу: %s

source: Error registering new hook: %s
uk: Помилка реєстрації нового обробника: %s

source: Error parsing FSRule: %s
uk: Помилка розбору правила FSRule: %s

source: Error creating Palette instance: %s
uk: Помилка створення екземпляру Palette: %s

source: Error creating Skin instance: %s
uk: Помилка створення екземпляру Skin: %s

source: Error in DSL execution: %s
uk: Помилка виконання DSL: %s

source: Error extending FSRule: token %s already registered
uk: Помилка розширення FSRule: токен %s вже зареєстровано

source: Error extending FSRule: trans_func and match_func arguments must be functions.
uk: Помилка розширення FSRule: аргументи trans_func та match_func мають бути функціями.

source: Invalid argument type: %s, VFSObject expected
uk: Неправильний тип аргументу: %s, очікується VFSObject

source: Error in calling extended transformation function: %s
uk: Помилка виклику перетворюючої функції: %s

source: Invalid type{} argument: %s
uk: Неправильний аргумент виразу type{}: %s

source: Invalid owner{} argument: %s
uk: Неправильний аргумент виразу owner{}: %s

source: Invalid uid: %s
uk: Неправильний uid: %s

source: Invalid gid: %s
uk: Неправильний gid: %s.

source: Invalid perm{} argument: %s
uk: Неправильний аргумент виразу perm{}: %s

source: Invalid size{} argument: %s
uk: Неправильний аргумент виразу size{}: %s

source: Error in calling extended match function: %s
uk: Помилка виклику розширеної співставляючої функції: %s

source: Unable to find match function for token: %s
uk: Неможливо знайти співставляючу функцію для токена: %s

source: HookManager: Callable argument expected
uk: HookManager: очікується аргумент, що викликається

source: Error running callback procedure for event %s
uk: Помилка виклику зворотньої функції для події %s

source: Invalid shortcut type: %s.
uk: Неправильний тип клавіші швидкого доступу: %s.

source: Method %s not loaded
uk: Метод %s не завантажено

source: Load error: %s
uk: Помилка завантаження: %s

source: <Internal function object>
uk: <Внутрішня функція>

source: Invalid method type: %s. Must be string or function
uk: Неправильний тип методу: %s. Має бути рядок або функція

source: Unable to bind method %s. Plugin %s doesn't export it.
uk: Неможливо призначити метод %s. Плагін %s не експортує його.

source: Logger console
uk: Журнал

source: Logger plugin
uk: Журнал

source: %s is not a public method
uk: %s не є загальнодоступним методом

source: %s is not a public data object
uk: %s не є загальнодоступним об'єктом

source: Plugin %s is disabled or does not exist
uk: Плагін %s відключений або не існує

source: Unable to find required %s class
uk: Неможливо знайти потрібний крас %s

source: %s plugin instance does not export method %s
uk: Плагін %s не експортує метод %s

source: %s plugin instance does not export data object %s
uk: Плагін %s не експортує об'єкт %s

source: Error in wait_for() callback: %s
uk: Помилка в функції wait_for(): %s

source: BasePlugin instance expected, got: %s
uk: Очікується об'єкт класу BasePlugin, отримано: %s

source: Invalid plugin path: %s
uk: Неправильний шлях: %s.

source: Max-size must be a positive integer number
uk: Max-size має бути додатнім цілим числом

source: Invalid skin argument: %s. libxyz.core.Skin instance expected!
uk: Неправильний тип аргументу: %s. Очікується libxyz.core.Skin!

source: Attribute %s is a constant
uk: Атрибут %s є константою

source: Invalid value %s. A list of valid log levels expected
uk: Неправильне значення %s. Очікується список коректних рівнів відлагодження

source: Invalid value %s. A positive integer expected
uk: Неправильне значення %s. Очікується додатнє число

source: Skin %s is not usable with requested color settings. Using default.
uk: Тему %s неможливо використати із запитаною кольоровою схемою. Використовується значення по замовчуванню.

source: Error parsing system config %s: %s
uk: Помилка розбору системного конфігураційного файлу %s: %s

source: Error parsing user config %s: %s
uk: Помилка розбору користувацького конфігураційного файла %s: %s

source: Skipping skin %s due to parsing error: %s
uk: Пропускаю тему %s через помилки розбору: %s

source: Error parsing config %s: %s
uk: Помилка розбору конфігураційного файлу %s: %s

source: %s version %s Usage: %s [-d driver][-c colors][-s skin][-lvh] -d -- Display driver (raw (default) or curses) -c -- Number of colors terminal supports (1, 16 (default), 88, 256) -s -- Skin name -l -- Show available skins -v -- Show version -h -- Show this help message
uk: %s версія %s Використання: %s [-d driver][-c colors][-s skin][-lvh] -d -- Драйвер відображення (raw (по замовчуванню) чи curses) -c -- Кількість кольорів, що підтримується терміналом (1, 16 (по замовчуванню), 88, 256) -s -- Назва теми -l -- Показати список доступних тем -v -- Показати версію -h -- Показати це довідкове повідомлення

source: %s version %s
uk: %s версія %s

source: Must be implemented in child class
uk: Має бути реалізовано в дочірньому класі

source: Parse error on line %d
uk: Помилка розбору на рядку %d

source: Parse error
uk: Помилка розбору

source: Unexpected token '%s'. Waiting for '%s'
uk: Неправильний токен '%s'. Очікується '%s'

source: Syntax error
uk: Синтаксична помилка

source: Invalid opt type: %s. Dictionary expected.
uk: Неправильний тип аргументу: %s. Очікується словник (dict)

source: Unknown variable %s
uk: Невідома змінна %s

source: Invalid variable name: %s
uk: Неправильна назва змінної: %s

source: Variable transformation error: %s
uk: Помилка перетворення змінної: %s

source: Invalid value: %s
uk: Неправильне значення: %s

source: Undefined macro %s
uk: Невизначений макрос %s

source: Unterminated quote
uk: Незакриті лапки

source: Unclosed block
uk: Незакритий блок

source: Unterminated expression
uk: Незавершений вираз

source: Invalid argument type %s. Dictionary expected
uk: Неправильний тип аргументу: %s, очікується словник (dict)

source: Unknown keyword: %s
uk: Невідоме ключове слово: %s

source: Invalid argument type %s. BaseParser or subclassed expected
uk: Неправильний тип аргументу: %s, очікується BaseParser чи похідні

source: %s: parse error on line %d: %s
uk: %s: помилка розбору на рядку %d: %s

source: Unmatched line %d: %s
uk: рядок невідповідності %d: %s

source: Source string
uk: Вихідний рядок

source: Error
uk: Помилка

source: Press ENTER to submit value. ESCAPE to quit
uk: Натисніть ENTER, щоб ввести значення. ESCAPE - щоб вийти

source: Yes
uk: Так

source: No
uk: Ні

source: Unable to open history data file: %s
uk: Неможливо відкрити файл-історію: %s

source: Command line plugin
uk: Командний рядок

source: Command line plugin. It allows to enter, edit and execute commands.
uk: Модуль командного рядку. Дозволяє вводити, редагувати та виконувати команди системної оболонки.

source: Configuration variables: undo_depth - Specifies how many undo levels to keep. Default - 10 history_depth - Specifies how many entered commands to keep. Default - 50 prompt - Command line prompt. Default - '$ '
uk: Параметри конфігурації: undo_depth - Розмір буферу відміни. По замовчуванню - 10 history_depth - Розмір буферу введених команд. По замовчуванню - 50 prompt - Запрошення командного рядку. По замовчуванню - '$ '

source: Unable to execute commands on non-local filesystems
uk: Неможливо виконати команди на нелокальних файлових системах

source: Error executing internal command %s: %s
uk: Помилка виконання внутрішньої команди %s: %s

source: Invalid alias type: %s
uk: Неправильний тип псевдоніму: %s

source: Unable to replace an alias %s: %s
uk: Неможливо замінити псевдонім %s: %s

source: History
uk: Історія

source: Invalid %s color: %s
uk: Неправильний колір %s: %s

source: Invalid argument type %s, libxyz.ui.color.Foreground instance expected.
uk: Неправильний тип аргументу: %s, очікується libxyz.color.Foreground

source: Invalid argument type %s, libxyz.ui.color.Background or instance expected.
uk: Неправильний тип аргументу: %s, очікується libxyz.ui.color.Background

source: Invalid argument type %s, libxyz.ui.color.Attribute instance expected.
uk: Неправильний тип аргументу: %s. Очікується libxyz.ui.color.Attribute

source: Invalid argument type %s, libxyz.ui.color.ForegroundHigh instance expected.
uk: Неправильний тип аргументу: %s, очікується libxyz.ui.color.ForegroundHigh

source: Invalid argument type %s, libxyz.ui.color.BackgroundHigh instance expected.
uk: Неправильний тип аргументу: %s, очікується libxyz.ui.color.BackgroundHigh

source: Error in entry callback: %s
uk: Помилка у виклику функції: %s

source: Error compiling filter: %s
uk: Помилка компіляції фільтру: %s

source: Error executing bind (%s): %s
uk: Помилка виконання (%s): %s

source: System runtime plugin
uk: Системний модуль

source: Panel plugin
uk: Навігаційна панель

source: Configuration variables: filters_enabled - Enable permanent filters. Default - False filters_policy - Filters policy. If True - filter out objects matching the rule. If False - filter out objects which do not match the rule. Default - True filters - List of permanent filters. Filters applied in defined order sequentially. Default - [] sorting_policy - Active sorting policy name or None. Default - None sorting - Defined sorting policies. Each key corresponds to a policy name and value is either a function with two arguments (VFSObject) behaving like cmp() or a list of those functions. If value is a list, each function applied sequentially. Default - []
uk: Параметри конфігурації: filters_enabled - Включити фільтри. По замовчуванню - False filters_policy - Політика фільтрації. Якщо True - відфільтрувати об'єкти, що співпадають з правилом. Якщо False - відфільтрувати об'єкти, що не співпадають з правилом. По замовчуванню - True. filters - Список фільтрів. Фільтри послідовно застосовуються у вказаному порядку. По замовчуванню - [] sorting_policy - Назва активного методу сортування або None. По замовчуванню - None. sorting - Методи сортування. Ключ - назва методу, а значення - або функція від двох аргументів (VFSObject), що працює як cmp(), або ж список таких функцій. Якщо значення є списком - кожна функція використовується послідовно. По замовчуванню - [].

source: Fires before switching to another tab. Arguments: Block instance and old tab index.
uk: Запускається перед перемиканням на іншу вкладку. Аргументи: Об'єкт Block та індекс попередньої вкладки.

source: Fires when switching to another tab. Arguments: Block instance and new tab index.
uk: Запускається після перемикання на іншу вкладку. Аргументи: Об'єкт Block та індекс нової вкладки.

source: Fires when new tab is added. Arguments: Block instance and new tab index.
uk: Запускається при додаванні нової вкладки. Аргументи: Об'єкт Block та індекс нової вкладки.

source: Fires when tab is delete. Arguments: Block instance and deleted tab index.
uk: Запускається при видаленні вкладки. Аргументи: Об'єкт Block та індекс видаленої вкладки.

source: Really quit %s?
uk: Дійсно вийти з %s?

source: Unable to find `%s` sorting policy
uk: Неможливо знайти метод сортування `%s`

source: %s bytes (%d)
uk: %s байт (%d)

source: Tag group
uk: Відмітити групу

source: Untag group
uk: Зняти відмітку

source: Type FS Rule
uk: Введіть FS Rule

source: Action error: %s
uk: Помилка: %s

source: Unable to chdir to %s: %s
uk: Неможливо перейти в %s: %s

source: TAGGED
uk: ВІДМІТКА

source: Only one of the arguments must be provided
uk: Необхідно надати тільки один з аргументів

source: Invalid class: %s. VFSObject derived expected.
uk: Неправильний клас: %s. Вимагається дочірній від VFSObject

source: Invalid path: %s.
uk: Неправильний шлях: %s.

source: Unable to find VFS handler for %s.
uk: Неможливо знайти обробник для %s.

source: Object must be opened before any operation
uk: Об'єкт має бути відкритим до початку роботи з ним

source: Unable to walk on %s
uk: Неможливо перейти в %s

source: Unable to create directory inside %s object type
uk: Неможливо створити каталог всередині об'єкту типу %s

source: Name
uk: Ім'я

source: Type
uk: Тип

source: Access time
uk: Дата доступу

source: Modification time
uk: Дата зміни даних (mtime)

source: Change time
uk: Дата зміни inode (ctime)

source: Size in bytes
uk: Розмір в байтах

source: Owner
uk: Власник

source: Group
uk: Група

source: Access mode
uk: Режим доступу

source: Type-specific data
uk: Додаткові дані

source: Unable to stat file %s: %s
uk: Неможливо отримати інформацію про файл %s: %s

source: Error creating VFS object: %s
uk: Помилка створення VFS об'єкту: %s

source: Unable to chown %s: %s
uk: Неможливо змінити власника %s: %s

source: Unable to chmod %s: %s
uk: Неможливо змінити права доступу %s: %s

source: Feature not implemented
uk: Дана функція не реалізована

source: Show keybindings
uk: Комбінації клавіш

source: Plugin is used to display all current keybindings along with corresponding contextes and methods
uk: Плагін призначений для показу всіх поточних прив'язок клавіш та відповідних контекстів і методів

source: Event is fired before showing dialog. Receives no arguments.
uk: Запускається при показі діалогу. Аргументи: Немає

source: Bind
uk: Прив'язка

source: Context
uk: Контекст

source: Method / Description
uk: Метод / Опис

source: Keybindings
uk: Комбінації клавіш

source: Error ininitalizing plugin: %s
uk: Помилка ініціалізації плагіну: %s

source: Complete
uk: Доповнення

source: Interactive management console
uk: Консоль керування

source: Provides interactive management console
uk: Інтерактивна консоль керування

source: Configuration variables: history_depth - Specifies how many entered commands to keep. Default - 50 prompt - Command line prompt. Default - '> '
uk: Параметри конфігурації: history_depth - Розмір буферу введених команд. По замовчуванню - 50 prompt - Запрошення командного рядка. По замовчуванню - '> '

source: Fires upon showing console. Arguments: No.
uk: Запускається при показі консолі. Аргументи: Немає

source: Fires when scrolling through history. Arguments: Current command from history buffer
uk: Запускається при переборі буферу команд. Аргументи: поточна команда з буферу

source: Fires when typed command is to be executed. Arguments: typed command
uk: Запускається перед виконанням команди. Аргументи: команда

source: Management console
uk: Консоль керування

source: Setup terminal keycodes
uk: Налаштування термінальних кодів

source: keycodes plugin is used to properly configure terminal keycodes. For each terminal type keycodes are stored independently. Terminal type determined by examining TERM environment variable.
uk: Плагін призначений для налаштування термінальних кодів клавіатури. Для кожного типу терміналу коди зберігаються окремо. Тип терміналу визначається читанням змінної середовища TERM.

source: Fires upon showing dialog
uk: Запускається при показі діалогу

source: Please press key %s Press ENTER to skip key Press ESCAPE to quit dialog
uk: Будь ласка, натисніть клавішу %s Натисніть ENTER, щоб пропустити поточну клавішу Натисніть ESCAPE, щоб вийти

source: Save learned keys?
uk: Зберегти дані?

source: Unable to open file: %s
uk: Неможливо відкрити файл: %s

source: Unable to save learned data
uk: Неможливо зберегти дані

source: Show plugin list
uk: Список активних плагінів

source: Show all currently loaded plugins and associated information
uk: Показати всі завантажені плагіни

source: Fires upon showing dialog. Arguments: No
uk: Запускається при показі діалогу. Аргументи: Немає

source: Fires when showing detailed plugin info.Arguments: Plugin object
uk: Запускається при показі детальної інформації про плагін. Аргументи: Об'єкт плагіну

source: Active plugins list
uk: Список активних плагінів

source: Author: %s
uk: Автор: %s

source: Version: %s
uk: Версія: %s

source: Minimal compatible version: %s
uk: Мінімальна сумісна версія: %s

source: Homepage: %s
uk: Домашня сторінка: %s

source: Public data
uk: дані

source: Public methods
uk: Методи

source: N/A
uk: Н/Д

source: Plugin doc
uk: Документація

source: Plugin events
uk: Події

source: Plugin info %s
uk: Інформація про плагін %s

source: Error setting up bash: %s
uk: Помилка налаштування bash: %s

source: Shell wrapper
uk: Обгортка для системної оболонки

source: Execute commands in external shell
uk: Виконання команд у зовнішній оболонці

source: Fires before command execution. Arguments: a command to be executed
uk: Запускається перед виконанням команди. Аргументи: команда

source: Press ENTER to continue...
uk: Натисніть ENTER для продовження...

source: Magic database FSRule
uk: FSRule для бази даних magic

source: Plugin extends FSRule functionality to match objects based on magic database description
uk: Плагін розширює функціональність FSRule можливістю відмічати об'єкты у відповідності з базою magic

source: About plugin
uk: Плагін - 'Про програму'

source: Save panels locations
uk: Зберегти розташування панелей

source: When starting load previously saved locations
uk: При старті завантажує збережені раніше позиції

source: Unable to open where data file: %s
uk: Неможливо відкрити файл з даними: %s

source: Frequently used directories
uk: Каталоги, що часто використовуються

source: Bookmarks
uk: Закладки

source: Unable to open bookmarks file: %s
uk: Неможливо відкрити файл закладок: %s

source: Error parsing bookmarks file: %s
uk: Помилка розбору файлу закладок: %s

source: Test input
uk: Тест вводу

source: Simple dialog to show pressed keys. Shortcut is what XYZCommander expects to see in configuration files. Raw is what low-level library emits to focus widget. If any keybinding currently exists for key it is shown on the bottom line
uk: Діалог показу натиснутих клавіш. Shortcut - те, що XYZCommander очікує побачити в конфігураційних файлах. Raw - значення, що передається драйвером відображення. Якщо до введеної комбінації клавіш прив'язана якась функція, вона відображається в нижній частині вікна

source: Press any key. Escape twice to quit.
uk: Натисніть будь-яку клавішу. Натисніть Escape двічі, щоб вийти.

source: Input test
uk: Тест введених значень

source: Show VFS object information
uk: Інформація про об'єкт VFS

source: Show detailed information provided by VFS layer
uk: Показати додаткову інформацію, доступну через підсистему VFS

source: Event is fired upon showing file-info dialog. Arguments: Currently selected VFSObject instance
uk: Подія запускається при показі інформації про файл. Аргументи: Обраний об'єкт VFSObject

source: VFS Object Info
uk: Інформація про об'єкт VFS

source: Source:
uk: Джерело:

source: Destination:
uk: Призначення:

source: Save attributes
uk: Зберегти атрибути

source: Follow links
uk: Переходити за посиланнями

source: TAB to cycle. ENTER to submit. ESCAPE to cancel
uk: TAB - перемикання полів. ENTER - введення значення. ESCAPE - відмінити

source: Useful VFS routines
uk: Корисні утиліти VFS

source: Dialogs for common VFS operations
uk: Діалоги для дій з VFS

source: New directory name
uk: Назва нового каталогу

source: Create directory
uk: Створити каталог

source: Unable to create directory: %s
uk: Неможливо створити каталог: %s

source: Really remove %d objects?
uk: Справді видалити %d об'єктів?

source: Really remove %s (%s)?
uk: Справді видалити %s (%s)?

source: Remove object
uk: Видалити об'єкт

source: All
uk: Все

source: Abort
uk: Перервати

source: Directory is not empty Remove it recursively?
uk: Каталог не порожній Видалити рекурсивно?

source: Remove %s
uk: Видалити %s

source: Removing object: %s
uk: Видалення об'єкту: %s

source: Removing
uk: Видалення

source: Unable to remove object: %s
uk: Неможливо видалити об'єкт: %s

source: Error removing object: %s
uk: Помилка видалення об'єкту: %s

source: %d objects
uk: %d об'єктів

source: Move
uk: Перемістити

source: Moving object: %s
uk: Переміщення об'єкту: %s

source: Moving
uk: Переміщення

source: Unable to move object: %s
uk: Неможливо перемістити об'єкт: %s

source: Move error
uk: Помилка переміщення

source: Copy
uk: Копіювати

source: Copying object: %s
uk: Копіювання об'єкту: %s

source: Copying
uk: Копіювання

source: Unable to copy object: %s
uk: Неможливо скопіювати об'єкт: %s

source: Copy error
uk: Помилка копіювання

source: ESCAPE to abort
uk: ESCAPE - перервати

source: Skip
uk: Пропустити

source: Skip all
uk: Пропустити все

source: Object %s already exists. Really override?
uk: Об'єкт %s вже існує. Перезаписати?

source: Override %s
uk: Перезаписати %s

source: An error occured %s: %s
uk: Сталась помилка %s: %s
